[
  {
    "id": "Overview",
    "source_type": "reference",
    "part_number": null,
    "part_title": "OVERVIEW",
    "article_number": null,
    "article_title": "Constitution Overview",
    "content": "The Constitution of India is the supreme legal document of India, and the longest written national constitution in the world. The document lays down the framework that demarcates fundamental political code, structure, procedures, powers, and duties of government institutions and sets out fundamental rights, directive principles, and the duties of citizens. It espouses constitutional supremacy and was adopted with a declaration in its preamble. The Constituent Assembly of India adopted the constitution on 26 November 1949 and became effective on 26 January 1950. It became the country's fundamental governing document, and the Dominion of India became the Republic of India.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Basic_Info",
    "source_type": "reference",
    "part_number": null,
    "part_title": "BASIC INFORMATION",
    "article_number": null,
    "article_title": "Basic Details",
    "content": "Jurisdiction: India. Ratified: 26 November 1949. Date effective: 26 January 1950. System: Federal parliamentary constitutional republic. Government structure has Three Branches (Executive, Legislature, and Judiciary). Head of state: President of India. Chambers: Two (Rajya Sabha and Lok Sabha). Executive: Prime Minister of India–led cabinet responsible to the lower house of the parliament. Judiciary: Supreme court, high courts, and district courts. Federalism: Federal. Electoral college: Yes, for presidential and vice presidential elections. Entrenchments: 2. Amendments: 106. Last amended: 28 September 2023 (106th). Location: Samvidhan Sadan, New Delhi, India. Signatories: 284 members of the Constituent Assembly. Supersedes: Government of India Act 1935 and Indian Independence Act 1947.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Constitutional_Declaration",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUTIONAL DECLARATION",
    "article_number": null,
    "article_title": "Constitutional Declaration",
    "content": "The constitution declares India a sovereign, socialist, secular, and democratic republic, assures its citizens justice, equality, and liberty, and endeavours to promote fraternity. The original 1950 constitution is preserved in a nitrogen-filled case at the Parliament Library Building in New Delhi.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Background_Nehru_Report",
    "source_type": "reference",
    "part_number": null,
    "part_title": "BACKGROUND",
    "article_number": null,
    "article_title": "Nehru Report",
    "content": "In 1928, the All Parties Conference convened a committee in Lucknow to prepare the Constitution of India, which was known as the Nehru Report.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Background_British_Rule",
    "source_type": "reference",
    "part_number": null,
    "part_title": "BACKGROUND",
    "article_number": null,
    "article_title": "British Rule Period",
    "content": "With the exception of scattered French and Portuguese exclaves, India was under the British rule from 1858 to 1947. From 1947 to 1950, the same legislation continued to be implemented as India was a dominion of United Kingdom for these three years, as most of the princely states were convinced by Jawaharlal Nehru, Sardar Patel and Louis Mountbatten to sign the articles of integration with India, and the British Government continued to be responsible for the external security of the country. Thus, the constitution of India repealed the Indian Independence Act 1947 and Government of India Act 1935 when it became effective on 26 January 1950. India ceased to be a dominion of the British Crown and became a sovereign, democratic republic with the constitution.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Articles_Enforcement",
    "source_type": "reference",
    "part_number": null,
    "part_title": "BACKGROUND",
    "article_number": null,
    "article_title": "Enforcement of Articles",
    "content": "Articles 5, 6, 7, 8, 9, 60, 324, 366, 367, 379, 380, 388, 391, 392, 393, and 394 of the constitution came into force on 26 November 1949, and the remaining articles became effective on 26 January 1950 which is celebrated every year in India as Republic Day.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Previous_Legislation",
    "source_type": "reference",
    "part_number": null,
    "part_title": "BACKGROUND",
    "article_number": null,
    "article_title": "Previous Legislation",
    "content": "The Indian constitution was drawn from a number of sources, mainly the Government of India Act 1935 which was significantly drafted by Samuel Hoare. Mindful of India's needs and conditions, its framers borrowed features of previous legislation such as the Government of India Act 1858, the Indian Councils Acts of 1861, 1892 and 1909, the Government of India Acts 1919 and 1935, and the Indian Independence Act 1947. The latter, which led to the creation of Pakistan, divided the former Constituent Assembly in two. Each new assembly had sovereign power to draft and enact a new constitution for the separate states.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Constituent_Assembly_Formation",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Formation and Composition",
    "content": "The constitution was drafted by the Constituent Assembly, which was elected by elected members of the provincial assemblies. The 389-member assembly (reduced to 299 after the partition of India) took almost three years to draft the constitution holding eleven sessions over a 165-day period.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Drafting_Committee_Tribute",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "T. T. Krishnamachari's Statement",
    "content": "In the constitution assembly, a member of the drafting committee, T. T. Krishnamachari said: Mr. President, Sir, I am one of those in the House who have listened to Dr. Ambedkar very carefully. I am aware of the amount of work and enthusiasm that he has brought to bear on the work of drafting this Constitution. At the same time, I do realise that that amount of attention that was necessary for the purpose of drafting a constitution so important to us at this moment has not been given to it by the Drafting Committee. The House is perhaps aware that of the seven members nominated by you, one had resigned from the House and was replaced. One died and was not replaced. One was away in America and his place was not filled up and another person was engaged in State affairs, and there was a void to that extent. One or two people were far away from Delhi and perhaps reasons of health did not permit them to attend. So it happened ultimately that the burden of drafting this constitution fell on Dr. Ambedkar and I have no doubt that we are grateful to him for having achieved this task in a manner which is undoubtedly commendable.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Ambedkar_Concluding_Speech",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "B. R. Ambedkar's Concluding Speech",
    "content": "B. R. Ambedkar in his concluding speech in constituent assembly on 25 November 1949 stated that: The credit that is given to me does not really belong to me. It belongs partly to Sir B.N. Rau the Constitutional Advisor to the Constituent Assembly who prepared a rough draft of the Constitution for the consideration of Drafting Committee. A part of the credit must go to the members of the Drafting Committee who, as I have said, have sat for 141 days and without whose ingenuity to devise new formulae and capacity to tolerate and to accommodate different points of view, the task of framing the Constitution could not have come to so successful a conclusion. Much greater share of the credit must go to Mr. S. N. Mukherjee, the Chief Draftsman of the Constitution. His ability to put the most intricate proposals in the simplest and clearest legal form can rarely be equalled, nor his capacity for hard work. He has been an acquisition to the Assembly. Without his help this Assembly would have taken many more years to finalise the Constitution. I must not omit to mention the members of the staff working under Mr. Mukherjee. For, I known how hard they worked and how long they have toiled sometimes even beyond midnight. I want to thank them all for their effort and their co-operation.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Amendments_Disposed",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Amendments Discussion",
    "content": "While deliberating the revised draft constitution, the assembly moved, discussed and disposed off 2,473 amendments out of a total of 7,635.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_1",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 6 December 1946",
    "content": "6 December 1946: Formation of the Constitution Assembly (in accordance with French practice).",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_2",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 9 December 1946",
    "content": "9 December 1946: The first meeting was held in the constitution hall (now the Central Hall of Parliament House). The 1st person to address was J. B. Kripalani, Sachchidananda Sinha became temporary president. (Demanding a separate state, the Muslim League boycotted the meeting.)",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_3",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 11 December 1946",
    "content": "11 December 1946: The Assembly appointed Rajendra Prasad as its president, H. C. Mukherjee as its vice-president and, B. N. Rau as constitutional legal adviser. (There were initially 389 members in total, which declined to 299 after partition, out of the 389 members, 292 were from government provinces, four from chief commissioner provinces and 93 from princely states.)",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_4",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 13 December 1946",
    "content": "13 December 1946: An Objective Resolution was presented by Jawaharlal Nehru, laying down the underlying principles of the constitution. This later became the Preamble of the Constitution.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_5",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 22 January 1947",
    "content": "22 January 1947: Objective resolution unanimously adopted.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_6",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 22 July 1947",
    "content": "22 July 1947: National flag adopted.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_7",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 15 August 1947",
    "content": "15 August 1947: Achieved independence. India split into the Dominion of India and the Dominion of Pakistan.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_8",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 29 August 1947",
    "content": "29 August 1947: Drafting Committee appointed with B. R. Ambedkar as its chairman. The other six members of committee were K.M. Munshi, Muhammed Sadulla, Alladi Krishnaswamy Iyer, N. Gopalaswami Ayyangar, Devi Prasad Khaitan and BL Mitter.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_9",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 16 July 1948",
    "content": "16 July 1948: Along with Harendra Coomar Mookerjee, V. T. Krishnamachari was also elected as second vice-president of Constituent Assembly.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_10",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 26 November 1949",
    "content": "26 November 1949: The Constitution of India was passed and adopted by the assembly.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_11",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 24 January 1950",
    "content": "24 January 1950: Last meeting of Constituent Assembly. The Constitution was signed and accepted (with 395 Articles, 8 Schedules, and 22 Parts).",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Timeline_Formation_12",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Timeline - 26 January 1950",
    "content": "26 January 1950: The Constitution came into force. (The process took 2 years, 11 months and 18 days—at a total expenditure of ₹6.4 million to finish.)",
    "source": "Constitution of India PDF"
  },
  {
    "id": "First_Speaker",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "First Speaker",
    "content": "G. V. Mavlankar was the first Speaker of the Lok Sabha (the lower house of Parliament) after India turned into a republic.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Membership_Key_Figures",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Key Figures in Assembly",
    "content": "B. R. Ambedkar, Sanjay Phakey, Jawaharlal Nehru, C. Rajagopalachari, Rajendra Prasad, Vallabhbhai Patel, Kanaiyalal Maneklal Munshi, Ganesh Vasudev Mavalankar, Sandipkumar Patel, Abul Kalam Azad, Shyama Prasad Mukherjee, Nalini Ranjan Ghosh, and Balwantrai Mehta were key figures in the assembly, which had over 30 representatives of the scheduled classes. Frank Anthony represented the Anglo-Indian community, and the Parsis were represented by H. P. Modi. Harendra Coomar Mookerjee, a Christian assembly vice-president, chaired the minorities committee and represented non-Anglo-Indian Christians. Ari Bahadur Gurung represented the Gorkha community. Judges, such as Alladi Krishnaswamy Iyer, Benegal Narsing Rau, K. M. Munshi and Ganesh Mavlankar were members of the assembly. Female members included Sarojini Naidu, Hansa Mehta, Durgabai Deshmukh, Amrit Kaur and Vijaya Lakshmi Pandit.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Membership_Presidents",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Presidents of Assembly",
    "content": "The first, two-day president of the assembly was Sachchidananda Sinha; Rajendra Prasad was later elected president. It met for the first time on 9 December 1946.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Drafting_BN_Rau",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "B. N. Rau's Role",
    "content": "Sir B. N. Rau, a civil servant who became the first Indian judge in the International Court of Justice and was president of the United Nations Security Council, was appointed as the assembly's constitutional advisor in 1946. Responsible for the constitution's general structure, Rau prepared its initial draft in February 1948. The draft of B.N. Rau consisted of 243 articles and 13 schedules which came to 395 articles and 8 schedules after discussions, debates and amendments.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Drafting_Committee_Work",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Drafting Committee Process",
    "content": "At 14 August 1947 meeting of the assembly, committees were proposed. Rau's draft was considered, debated and amended by the seven-member drafting committee, which was appointed on 29 August 1947 with B. R. Ambedkar as chair. A revised draft constitution was prepared by the committee and submitted to the assembly on 4 November 1947.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Drafting_Adoption",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Adoption of Constitution",
    "content": "Before adopting the constitution, the assembly held eleven sessions in 165 days. On 26 November 1949, it adopted the constitution, which was signed by 284 members. The day is celebrated as National Law Day, or Constitution Day. The day was chosen to spread the importance of the constitution and to spread thoughts and ideas of Ambedkar.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Drafting_Final_Session",
    "source_type": "reference",
    "part_number": null,
    "part_title": "CONSTITUENT ASSEMBLY",
    "article_number": null,
    "article_title": "Final Session and Production",
    "content": "The assembly's final session convened on 24 January 1950. Each member signed two copies of the constitution, one in Hindi and the other in English. The original constitution is hand-written, with each page decorated by artists from Shantiniketan including Beohar Rammanohar Sinha and Nandalal Bose. Its calligrapher was Prem Behari Narain Raizada. The constitution was published in Dehradun and photolithographed by the Survey of India. Production of the original constitution took nearly five years. Two days later, on 26 January 1950, it became the law of India. The estimated cost of the Constituent Assembly was ₹6.3 crore. The constitution has had more than 100 amendments since it was enacted.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_United_Kingdom",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "United Kingdom",
    "content": "From United Kingdom: Parliamentary government, Nominal head of the state, Post of Prime Minister, More powerful lower house, Concept of single citizenship, Legislative procedure, Bicameral legislature, Rule of law, Cabinet system, The legislative speaker and their role, Prerogative writ, Parliamentary privilege.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_United_States",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "United States",
    "content": "From United States: Bill of Rights (Fundamental rights), Written constitution, Preamble to the Constitution, Federal structure of government, Impeachment of the president, Post of the vice president and his functions, The institution of the Supreme Court, Removal of Supreme Court and High courts judges, Electoral College, Independent judiciary and separation of powers, Judicial review, President as commander-in-chief of the armed forces, Equal protection under law.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_Ireland",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "Ireland",
    "content": "From Ireland: Directive principles of state policy, Nomination of members to the Rajya Sabha by the president, Method of election of the president.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_Australia",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "Australia",
    "content": "From Australia: Freedom of trade between states, Federal legislative power to implement treaties, even on matters outside normal federal jurisdiction, Concurrent List, Provision of Joint Session of the Parliament, Preamble terminology.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_France",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "France",
    "content": "From France: Notions of liberté, égalité, fraternité (liberty, equality, fraternity) in the preamble, The ideals of republic in the preamble.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_Canada",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "Canada",
    "content": "From Canada: Quasi-federal government—a federal system with a strong central government, Distribution of powers between the central and state governments, Residual powers, retained by the central government, Appointment of Governor of states by Centre, Advisory jurisdiction of the Supreme Court.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_Soviet_Union",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "Soviet Union",
    "content": "From Soviet Union: Fundamental Duties under article 51-A, Mandated planning commission to oversee economic development, Ideals of justice (social, economic and political) in the preamble.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_Weimar_Republic",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "Weimar Republic",
    "content": "From Weimar Republic: Suspension of fundamental rights during emergency.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_South_Africa",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "South Africa",
    "content": "From South Africa: Amendment procedure of the constitution, Election of members of Rajya Sabha.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Influence_Japan",
    "source_type": "reference",
    "part_number": null,
    "part_title": "INFLUENCE OF OTHER CONSTITUTIONS",
    "article_number": null,
    "article_title": "Japan",
    "content": "From Japan: Procedure established by law, Laws on which the Supreme Court functions.",
    "source": "Constitution of India PDF"
  },
  {
    "id": "Structure_Overview",
    "source_type": "reference",
    "part_number": null,
    "part_title": "STRUCTURE",
    "article_number": null,
    "article_title": "Structure Overview",
    "content": "The Indian constitution is the world's longest for a sovereign nation. At its enactment, it had 395 articles in 22 parts and 8 schedules. At about 145,000 words, it is the second-longest active constitution—after the Constitution of Alabama—in the world. The amended constitution has a preamble and 470 articles, which are grouped into 25 parts. With 12 schedules and five appendices, it has been amended 106 times; the latest amendment was given assent on 28 September 2023.",
    "source": "Constitution of India PDF"
  }]